Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བར་སྣང་དེ་ལས་བབས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། རིན་པོ་ཆེའི་པད་མ་དེ་དག་ལ་འཁོད་དོ། །
en: Mañjuśrīkumārabhūta and the bodhisattvas then descended from the sky, prostrated at the feet of the Blessed One, and took their seats on the precious lotuses.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཁྱེན་བཞིན་དུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་ཁྱོད་ཅི་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་ལྷན་ཅིག་ཏུ་འདིར་འོངས།
en: Although he already knew the answer, the Blessed One then inquired of Mañjuśrīkumārabhūta, “Mañjuśrī, for what reason have you come here with these bodhisattvas?”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ན་ཆོས་སྟོན་པ་བདག་ཅག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་རིན་པོ་ཆེ་བཀོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་མཆིས་པས་ཐོས་ནས་བདག་ཅག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་།
en: Mañjuśrī replied, “While staying in the Ratnavyūhā world system, the buddha field of the blessed, Thus-Gone Ratnaketu, we heard that the Blessed One was teaching the Dharma in this place.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པར་འཚལ་བའི་སླད་དུ་འདིར་མཆིས་སོ། །
en: We came here because we wished to behold the Blessed One and listen to this Dharma discourse.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་བཀོད་པ་དེ་འདི་ནས་ཐག་ཇི་སྲིད་མཆིས་ན། སྐྱེས་བུ་དམ་པ་འདི་དག་འདི་ལྟར་མྱུར་བར་འདིར་མཆིས།
en: Venerable Mahākāśyapa then asked the Blessed One, “Blessed One, how far from here is the Ratnavyūhā world system, the buddha field of the blessed, Thus-Gone Ratnaketu, such that these holy beings have arrived here so quickly?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བཙུན་པ་འོད་སྲུང་ཆེན་པོ། གལ་ཏེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཕུན་སུམ་ཚོགས་པ་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་དེར་འགྲོ་ན། ཚེའི་ཚད་ཟད་ཅིང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་དེར་མི་ཕྱིན་ཏེ།
en: Mañjuśrī replied, “Revered Mahākāśyapa, if you, a master of miraculous powers, were to travel to that world system, your lifespan would end and you would pass into parinirvāṇa before reaching that buddha field.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་འདི་ནས་དེ་སྲིད་དོ། །
en: That is how far the world system is from here.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འོད་སྲུང་ཆུ་བོ་གང་གཱའི་ཀླུང་དྲུག་ཅུའི་བྱེ་མ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་བཀོད་པ་ཞེས་བྱ་བ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་ལྷགས་སོ། །
en: The Blessed One said, “Kāśyapa, these bodhisattva great beings have arrived from the Ratnavyūhā world system, having crossed as many buddha fields as there are grains of sand in sixty Ganges Rivers.”

source: གནས་བརྟན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དག་ཇི་སྲིད་ཀྱི་འདིར་མཆིས།
en: The elder then asked, “Blessed One, how long did it take them to arrive here?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། གནས་བརྟན་གྱིས་སེམས་ལེན་པ་མེད་པར་ཟག་པ་ལས་ཇི་སྲིད་ཀྱིས་སེམས་རྣམ་པར་གྲོལ་བ་དེ་སྲིད་ཀྱིས་སོ། །
en: Mañjuśrī replied, “Elder, it took them the same amount of time it takes for a mind to be liberated from defilements with no further appropriation.”

source: གནས་བརྟན་གྱིས་སྨྲས་པ། སྐྱེས་བུ་དམ་པ་དེ་དག་འདི་འདྲ་བར་མགྱོགས་པར་ལྷགས་པ་ནི་ངོ་མཚར་ཏོ། །
en: “Then the speed with which these holy beings have arrived here is amazing!”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: exclaimed the elder.

source: གནས་བརྟན་འོད་སྲུང་ཆེན་པོའི་སེམས་ཇི་སྲིད་ཀྱིས་རྣམ་པར་གྲོལ།
en: Mañjuśrī asked, “How long did it take for the elder Mahākāśyapa’s mind to be liberated?”

source: སྨྲས་པ། སྐད་ཅིག་པ་འགྱུར་བ་སྲིད་ཀྱིས་སོ། །
en: “It took just an instant.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། གནས་བརྟན་གྱི་སེམས་རྣམ་པར་གྲོལ་ལམ།
en: “Elder, is your mind liberated?”

source: སྨྲས་པ། འཇམ་དཔལ་རྣམ་པར་གྲོལ་ལོ། །
en: asked Mañjuśrī. “Yes, Mañjuśrī, it is liberated.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། སེམས་དེ་གང་གིས་བཅིངས་ནས་གང་ལས་རྣམ་པར་གྲོལ།
en: “What was binding your mind?” asked Mañjuśrī. “What was it liberated from?”

source: གནས་བརྟན་གྱིས་སྨྲས་པ། འཇམ་དཔལ་གལ་ཏེ་སེམས་བཅིངས་པར་གྱུར་ན་ནི་རྣམ་པར་མི་གྲོལ་ཏེ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བར་མི་འགྱུར་རོ། །
en: “Mañjuśrī,” replied the elder, “if my mind was bound, it would not be liberated, and there would be no liberating wisdom vision.”

source: སྨྲས་པ། བཙུན་པ་འོད་སྲུང་ཆེན་པོའི་སེམས་བཅིངས་པ་མེད་ན་རྣམ་པར་གྲོལ་བ་གང་ཡིན། སྨྲས་པ།
en: “If Revered Mahākāśyapa’s mind is not bound, what is its liberation?”

source: གང་བཅིངས་པ་མེད་པར་ཡོངས་སུ་ཤེས་པ་དེ་རྣམ་པར་གྲོལ་བའོ། །སྨྲས་པ།
en: “Understanding the absence of bondage is liberation.”

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོའི་སེམས་གང་གིས་སེམས་གང་ཡོངས་སུ་ཤེས།
en: “What is that mind through which Revered Mahākāśyapa understands? What is that mind that is understood?

source: འདས་པས་སམ།
en: Is it a past mind?

source: འོན་ཏེ་མ་འོངས་པས་སམ།
en: A future mind?

source: འོན་ཏེ་ད་ལྟར་བྱུང་བས་སམ།
en: A present mind?

source: གང་འདས་པ་དེ་ནི་ཟད་པ། གང་མ་འོངས་པ་དེ་ནི་མ་ཕྱིན་པ། གང་ད་ལྟར་བྱུང་བ་ནི་གནས་པ་མེད་པ་ཡིན་ན་སེམས་གང་གིས་སེམས་གང་ཡོངས་སུ་ཤེས།
en: The past is gone, the future is yet to come, and the present does not abide anywhere, so what is that mind that understands?

source: སྨྲས་པ།
en: What is that which is understood?”

source: འཇམ་དཔལ་འདི་ནི་འགོག་པ་སྟེ། དེ་ལ་སེམས་ཀྱི་བགྲང་བ་གང་ཡང་མེད་དོ། །
en: “Mañjuśrī, it is cessation; it is devoid of anything that can be regarded as a mind.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བཙུན་པ་འོད་སྲུང་སེམས་འགོག་པ་ཡོངས་སུ་ཤེས་སམ།
en: “Revered Kāśyapa, can mental cessation be understood?”

source: སྨྲས་པ། སེམས་འགོག་པ་ནི་ཡོངས་སུ་ཤེས་པར་མི་ནུས་སོ། །
en: “No, mental cessation cannot be understood.”

source: སྨྲས་པ། སེམས་དེ་ཐམས་ཅད་འགོག་པར་ལྟུང་བ་སྟེ། དེའི་ཕྱིར་ཅུང་ཟད་ཀྱང་ཡོངས་སུ་ཤེས་པར་འགྱུར་བ་མེད་དོ། །
en: Mañjuśrī replied, “The mind in which all has ceased is a downfall, because in it nothing is understood.”

source: སྨྲས་པ། འཇམ་དཔལ་ཁྱོད་སྤོབས་པར་གྱིས་ཤིག །
en: “Mañjuśrī, please speak on this.

source: ཁོ་བོ་ལ་ནི་ཁྱོད་ལ་ལན་གདབ་པའི་ནུས་པ་མེད་དོ། །
en: I am unable to reply to you.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བཙུན་པ་འོད་སྲུང་ཆེན་པོ་འདི་ལ་ཇི་སྙམ་དུ་སེམས། བྲག་ཅ་ལ་སྤོབས་པ་ཡོད་དམ། སྨྲས་པ།
en: “What do you think, Revered Mahākāśyapa,” asked Mañjuśrī, “does an echo have eloquence?”

source: མེད་དོ། །
en: “No.

source: བྲག་ཅ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཕྱིར་རོ། །
en: Because an echo is dependently arisen.”

source: སྨྲས་པ། བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱང་བྲག་ཅ་ལྟ་བུ་མ་ཡིན་ནམ།
en: “Revered Mahākāśyapa, are all phenomena not like echoes?”

source: སྨྲས་པ། འཇམ་དཔལ་དེ་དེ་བཞིན་ནོ། །
en: “Yes, Mañjuśrī, they are.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བཙུན་པ་འོད་སྲུང་ཆེན་པོ་འདི་ལ་ཇི་སྙམ་དུ་སེམས། བྲག་ཅའི་སྤོབས་པ་བཅད་ནུས་སམ། སྨྲས་པ།
en: “What do you think, Revered Mahākāśyapa, can an echo’s eloquence be interrupted?”

source: མི་བརྗོད་པས་དེ་བཅད་དོ། །
en: “It is interrupted when no words are uttered.”

source: སྨྲས་པ། བཙུན་པ་འོད་སྲུང་ཆེན་པོ་དེ་དེ་བཞིན་ཏེ།
en: “That is right, Revered Mahākāśyapa.

source: ཀུན་མི་འདྲི་བས་བྱང་ཆུབ་སེམས་དཔའི་སྤོབས་པ་ཆད་དོ། །
en: A bodhisattva’s eloquence is interrupted when no questions are asked.

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་གལ་ཏེ་བསྐལ་པར་ཡོངས་སུ་འདྲི་ན་ཡང་ཁོ་བོ་ཡང་བསྐལ་པར་སྤོབས་པར་འགྱུར་རོ། །
en: Revered Mahākāśyapa, if I were questioned for an eon, my eloquence would continue for that whole eon.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེས་བསྟན་པས་འཁོར་འདི་དག་གི་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་བདེ་བར་འགྱུར་བ་དང་། ཆོས་ཉིད་འདི་མངོན་སུམ་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བསྐུལ་དུ་གསོལ།
en: Venerable Mahākāśyapa then said to the Blessed One, “Blessed One, please exhort Mañjuśrīkumārabhūta to teach in such a way that this assembly will derive meaning, benefit, and well-being for a long time, such that the true nature of phenomena may be directly perceived.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་བརྩེགས་ཞེས་བྱ་བ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the bodhisattva great being Prajñākūṭa, who was seated in that assembly of bodhisattvas, said to Mañjuśrīkumārabhūta, “Mañjuśrī, what is the elder Mahākāśyapa thinking?

source: འཇམ་དཔལ་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་འདི་ཅིའི་ཕྱིར་སེམས་ཞིང་དམན་པ་དམན་པ་ལྟ་བུས་སྟོན།
en: Why does he teach in an inferior way?

source: འདི་ཅིའི་ཕྱིར་གནས་བརྟན་ཞེས་བྱ།
en: Why is he called an elder?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། འདི་ནི་ཉན་ཐོས་ཏེ་འཇིགས་པ་མེད་པ་མ་ཡིན་ནོ། །
en: Mañjuśrī replied, “He is a hearer, and as such he has not overcome fear.”

source: ཤེས་རབ་བརྩེགས་ཀྱིས་སྨྲས་པ། ཅི་འདི་ཐེག་པ་ཆེན་པོ་ལ་མ་ཞུགས་སམ།
en: Prajñākūṭa then asked, “Has he not entered the Great Vehicle?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་དེ་ནི་མ་ཡིན་ཏེ། འདི་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པས་རྣམ་པར་གྲོལ་བའོ། །
en: “No, noble son, he will be liberated through the vehicle of the hearers.”

source: སྨྲས་པ། འཇམ་དཔལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཞེས་བྱ་བ་འདི་ཇི་ལྟ་བུ།
en: “Mañjuśrī, what is the ‘vehicle of the hearers’ like?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་ཐེག་པ་གསུམ་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: “Noble son, the blessed, Thus-Gone Śākyamuni teaches the Dharma from the perspective of three vehicles.

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་ཆེན་པོ་སྟེ།
en: They are the vehicle of the hearers, the vehicle of the solitary buddhas, and the Great Vehicle.

source: ཐེག་པ་གསུམ་པོ་དེ་དག་གོ། །
en: There are thus three vehicles.

source: སེམས་ཅན་འདི་དག་ནི་དམན་པ་ལ་མོས་པའི་ཕྱིར་རོ། །སྨྲས་པ།
en: Because there are beings who are inclined toward the inferior.”

source: འཇམ་དཔལ་སྟོང་པ་ཉིད་ཚད་མེད། མཚན་མ་མེད་པ་ཚད་མེད། སྨོན་པ་མེད་པ་ཚད་མེད་ན་ཅིའི་ཕྱིར་ཉི་ཚེ་བའི་འདུ་ཤེས་སུ་མཛད།
en: “Mañjuśrī, if emptiness is boundless, signlessness is boundless, and wishlessness is boundless, then why fabricate limited notions?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཐབས་ལ་མཁས་པ་སྟེ།
en: “Noble son, the Thus-gone One is expert in skillful means.

source: གང་གི་ཕྱིར་སྟོང་པ་ཉིད་ཚད་མེད། མཚན་མ་མེད་པ་ཚད་མེད། སྨོན་པ་མེད་པ་ཚད་མེད་ཀྱང་ཉི་ཚེ་བའི་འདུ་ཤེས་ཀྱིས་མོས་པར་མཛད་དོ། །
en: Therefore, even though emptiness, signlessness, and wishlessness are boundless, he inspires interest in some beings by means of limited notions.”

source: སྨྲས་པ། འཇམ་དཔལ་བདག་ཕྱིར་ཞིང་དམན་པ་ལ་མོས་པའི་སེམས་ཅན་རྣམས་དང་ཕྲད་པར་འགྱུར་དུ་འོང་གིས་འགྲོའོ། །
en: “Mañjuśrī, lest I come into further contact with beings inclined toward inferior paths, I shall leave.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། རིགས་ཀྱི་བུ་རེ་ཞིག་སྡོད་ལ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་སྤོབས་པ་ཇི་ཙམ་པ་དང་། ཆོས་ཉིད་ཚད་མེད་པ་ཡང་ཉོན་ཅིག། །
en: Mañjuśrī replied, “Noble son, stay for a moment to hear the eloquence of the nāga king Anavatapta, who will speak about the boundlessness of the true nature of phenomena.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་དེ་ཅི་འདྲ་བའི་ཆོས་སྟོན། སྨྲས་པ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཏམ་སྟེ། རོ་གཅིག་པ་དང་།
en: Then Venerable Mahākāśyapa asked the bodhisattva Prajñākūṭa, “Noble son, how does the Thus-Gone Ratnaketu teach the Dharma?”

source: ཚད་མེད་པའི་ཆོས་ལས་བྱུང་བ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་། སངས་རྒྱས་ཉིད་དུ་འགྱུར་བ་དང་། གཞན་ལ་མོས་པ་མ་ཡིན་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་ཡང་དག་པར་འདུ་བའོ། །
en: “He teaches with tales of the buddhas and bodhisattvas, and he teaches about the single taste, origination from the boundless Dharma, irreversibility, becoming a buddha, not being inclined toward any other teachings, and omniscient wisdom.

source: འཇིགས་པ་མེད་པ་མ་ཡིན་པའི་སེམས་ཅན་རྣམས་ནི་དེར་མི་སྐྱེ་སྟེ། བཅོམ་ལྡན་འདས་དེའི་ཆོས་བསྟན་པ་ནི་དེ་འདྲའོ། །
en: Beings who have not overcome fear are not born there, so the Dharma teachings of that blessed one are like that.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་གང་ལ་བལྟ་བར་འདོད་དེ་འདིར་འོངས། ཅི་གཟུགས་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: Then, the nāga king Anavatapta addressed Mañjuśrīkumārabhūta: “Mañjuśrī, as for the thus-gone one that you came here wishing to behold—is it form that is beheld as a thus-gone one?”

source: སྨྲས་པ། དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ།
en: “No, it is not.”

source: ཅི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it feeling, perception, formation, or consciousness that is beheld as a thus-gone one?”

source: སྨྲས་པ། དེ་ནི་མ་ཡིན་ནོ། །
en: “No, it is not.”

source: སྨྲས་པ། ཅི་གཟུགས་ཀྱི་མི་རྟག་པ་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it the impermanence of form that is beheld as a thus-gone one?”

source: ཅི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་མི་རྟག་པ་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it the impermanence of feeling, perception, formation, and consciousness that is beheld as a thus-gone one?”

source: ཅི་གཟུགས་ཀྱི་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it the suffering of form, its selflessness, peacefulness, emptiness, signlessness, wishlessness, and absence of formation that is beheld as a thus-gone one?”

source: སྨྲས་པ། དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ། ཅི་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: “No, it is not.”

source: རྣམ་པར་ཤེས་པའི་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it the suffering of feeling, perception, formation, and consciousness and their selflessness, peacefulness, emptiness, signlessness, wishlessness, and absence of formation that are beheld as a thus-gone one?”

source: སྨྲས་པ། ཅི་གཟུགས་ཀྱི་མཚན་ཉིད་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Are the defining characteristics of form beheld as a thus-gone one?

source: རྣམ་པར་ཤེས་པའི་མཚན་ཉིད་ཀྱི་བར་དུ་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: Are the defining characteristics of the other aggregates up to consciousness beheld as a thus-gone one?”

source: སྨྲས་པ། ཅི་ཤའི་མིག་གིས་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it the physical eye that beholds a thus-gone one?”

source: ཅི་ལྷའི་མིག་གིས་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it the divine eye that beholds a thus-gone one?”

source: ཅི་ཤེས་རབ་ཀྱི་མིག་གིས་དེ་བཞིན་གཤེགས་པར་བལྟའམ།
en: “Is it the eye of insight that beholds a thus-gone one?”

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ་ཇི་ལྟ་བུ་ཡིན། འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: “Mañjuśrī, how does one behold a thus-gone one?”

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པ་ཅི་འདྲ་བ་དེ་འདྲ་བར་དེ་ལ་བལྟའོ། །སྨྲས་པ།
en: “Lord of nāgas, a thus-gone one is beheld just as he is.”

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་ཅི་འདྲ། སྨྲས་པ།
en: “Mañjuśrī, what is a thus-gone one like?”

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པ་ནི་མི་མཉམ་པ་དང་མཉམ་པ། མཚུངས་པ་མེད་པ། རབ་ཏུ་འདྲ་བ་མེད་པའོ། །
en: “Lord of nāgas, a thus-gone one is equal to the unequaled, peerless, and incomparable.

source: མི་མཉམ་པ་ཞེས་བྱ་བ་ནི།
en: Unequaled means unrivaled.

source: དེ་ལ་གཉེན་པོ་མེད་པའོ། །མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱ་བ་ནི་དེ་ལ་གཉེན་པོ་མཉམ་པ་ཡང་མེད་པའོ། །
en: Equal to the unequaled means he is unmatched.

source: མཚུངས་པ་མེད་ཅེས་བྱ་བ་ནི་གཟུགས་ཀྱི་མཚན་ཉིད་མ་ཡིན་པའི་ཕྱིར་རོ། །
en: He is peerless because he is not defined by the characteristics of form.

source: རབ་ཏུ་འདྲ་བ་མེད་ཅེས་བྱ་བ་ནི་རྟགས་མེད་ཅིང་མཚན་མ་མེད་པའི་ཕྱིར་རོ། །
en: He is incomparable because he is beyond marks and signs.

source: ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པ་ནི་དེ་འདྲ་སྟེ་དེ་ལྟར་བལྟ་བར་བྱའི། ཤའི་མིག་དང་།
en: Lord of nāgas, this is how a thus-gone one is, and this is how he should be seen.

source: ལྷའི་མིག་དང་། ཤེས་རབ་ཀྱི་མིག་གིས་བལྟ་བ་མ་ཡིན་ནོ། །
en: However, he cannot be seen with the physical eye, the divine eye, or the eye of insight.

source: ཤའི་མིག་ནི་སྣང་བ་མཐོང་བ་ཡིན་ལ། དེ་བཞིན་གཤེགས་པ་ནི་མུན་པ་དང་སྣང་བ་མ་ཡིན་པས་ཤའི་མིག་གིས་དེ་བལྟ་བར་མི་ནུས་སོ། །
en: Because the physical eye sees light, and a thus-gone one is neither light nor darkness and therefore cannot be seen with the physical eye.

source: ལྷའི་མིག་ནི་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད་ཡིན་ལ། དེ་བཞིན་གཤེགས་པ་ནི་ཤིན་ཏུ་མངོན་པར་འདུས་མ་བྱས་པས་ལྷའི་མིག་གིས་དེ་བལྟ་བར་མི་ནུས་སོ། །
en: Because the divine eye has the defining characteristic of formation, and a thus-gone one is utterly beyond formation and therefore cannot be seen with the divine eye.

source: ཤེས་རབ་ཀྱི་མིག་གིས་ནི་འབྱུང་བ་ཡོངས་སུ་ཤེས་པའི་མཚན་ཉིད་ཡིན་ལ། དེ་བཞིན་གཤེགས་པ་ནི་ཤིན་ཏུ་མི་འབྱུང་བས་ཤེས་རབ་ཀྱི་མིག་གིས་དེ་བལྟ་བར་མི་ནུས་སོ། །
en: Because the eye of insight has the defining characteristic of understanding origination, and a thus-gone one is utterly beyond origination and therefore cannot be seen with the eye of insight either.”

source: སྨྲས་པ། འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཇི་ལྟ་བུ་ཡིན།
en: “Mañjuśrī, what is the pure vision of a thus-gone one like?”

source: སྨྲས་པ། ཀླུའི་བདག་པོ་གང་གི་ཚེ་མིག་གི་རྣམ་པར་ཤེས་པའི་རྣམ་པར་ཤེས་པ་དང་། སེམས་ཀྱང་མི་སྐྱེ་ལ་གཟུགས་ཀྱི་རྣམ་པར་ཤེས་པའི་རྣམ་པར་ཤེས་པ་དང་། རྣམ་པར་ཤེས་པ་ཡང་མི་འགོག་པ་དེ་ཙམ་གྱིས་ན་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཡིན་ནོ། །
en: “Lord of nāgas, because the eye consciousness and the mind itself do not arise, and because the consciousness of form and consciousness itself do not cease, the vision of a thus-gone one is pure.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་ལྷགས་པ་དེ་དག་ངོ་མཚར་དུ་གྱུར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གང་དག་གིས་ཀླུའི་རྒྱལ་པོས་ཞུས་པ་འདི་ཐོས་པ་དང་། ཐོས་ནས་མོས་པ་དང་། མི་དངང་མི་སྐྲག་ལ་འཛིན་པ་དང་། སྟོན་པའི་སྐྱེས་བུ་དམ་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལེགས་པར་མཐོང་བ་ཡིན་ནོ། །
en: Amazed, the bodhisattva great beings who had arrived from the buddha field of the Thus-Gone Ratnaketu exclaimed, “Those holy beings who have heard these questions of the lord of nāgas, have faith in them, retain them without fear or terror, and teach them will truly see the Thus-Gone One.

source: བདག་ཅག་ཀྱང་འདིར་ལྷགས་ཤིང་ཚུལ་འདི་ཐོས་པས་བདག་ཅག་དོན་མེད་པར་མ་གྱུར་ཏོ། །གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པའི་གྲོང་དང་། གྲོང་ཁྱེར་དང་།
en: Even for us, it has not been without benefit to come here and hear about that way.

source: གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དེ་དག་ན་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་བ་དང་། དམ་པའི་ཆོས་ཀྱང་ནུབ་པར་མི་འགྱུར་བར་རིག་པར་བྱའོ། །
en: It should be known that in the villages, towns, cities, districts, countries, and royal palaces where this Dharma teaching is practiced, the Thus-Gone One will not pass into parinirvāṇa, and the sacred Dharma will not disappear.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདིས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཚར་གཅད་དོ། །མུ་སྟེགས་ཅན་གྱི་གནས་ཐམས་ཅད་ཕམ་པར་བྱས་སོ། །
en: This Dharma teaching overcomes the armies of Māra and vanquishes all the sites of non-Buddhists!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་མི་སྤྱོད་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་རྙེད་དཀའ་བ་མ་ཡིན་ནོ་ཞེས་བྱ་ན།
en: The nāga king Anavatapta then said to Mañjuśrīkumārabhūta, “Mañjuśrī, it is said that bodhisattvas who practice nonconduct have no difficulty reaching awakening.

source: འཇམ་དཔལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྤྱོད་པ་ལ་སྤྱོད་པ་ཞེས་བྱ།
en: Mañjuśrī, how do bodhisattvas engage in nonconduct?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ཀླུའི་བདག་པོ་གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཉིད་སེར་སྣ་ཅན་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་དེ།
en: Mañjuśrī replied, “Lord of nāgas, the emptiness of the conduct of those who engage in perfect generosity is the emptiness of the conduct of miserly beings.

source: སྤྱོད་པ་མཉམ་པ་དེ་ནི་མི་སྤྱོད་པ་ལ་སྤྱོད་པ་ཞེས་བྱའོ། །
en: That sameness of conduct is known as engaging in nonconduct.

source: ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་ཡང་དེ་བཞིན་ནོ། །
en: The same applies to discipline, patience, diligence, and concentration.

source: ཤེས་རབ་དང་ལྡན་པ་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ཤེས་རབ་འཆལ་པ་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་དེ།
en: The emptiness of the conduct of those with insight is the emptiness of the conduct of those with confused insight.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་འདོད་ཆགས་ལ་སྤྱོད་པ་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཉིད་འདོད་ཆགས་དང་བྲལ་བ་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་དེ།
en: Furthermore, lord of nāgas, the emptiness of the conduct of those who indulge in desire is the emptiness of the conduct of those who are free of desire.

source: ཞེ་སྡང་ལ་སྤྱོད་པ་རྣམས་དང་། གཏི་མུག་ལ་སྤྱོད་པ་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །
en: The same applies to those who indulge in aversion and delusion.

source: ཆ་མཉམ་པ་ལ་སྤྱོད་པ་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ཉོན་མོངས་པ་མེད་པ་རྣམས་ཀྱི་སྤྱོད་པའི་སྟོང་པ་ཉིད་དེ།
en: The emptiness of the conduct of those who indulge in all the afflictions in similar proportions is the emptiness of the conduct of those who have no afflictions.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གང་དག་གསུངས་པ་སྤྱོད་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་གི་སྤྱོད་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཉིད་འཕགས་པ་རྣམ་པར་གྲོལ་བའི་སྤྱོད་པའི་སྟོང་པ་ཉིད་དེ།
en: “Furthermore, lord of nāgas, the emptiness of the conduct related to the eighty-four thousand activities of the thus-gone ones and the eighty-four thousand collections of Dharma teachings is the emptiness of the liberated conduct of the noble ones.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱད་པ་སྤྱོད་པ་ན་སྤྱོད་པ་དེ་ལ་མི་སྤྱོད་པས་སྤྱོད་དེ།
en: “Furthermore, lord of nāgas, when bodhisattvas engage in conduct, they engage in that conduct through nonconduct.

source: སྤྱད་པ་སྤྱོད་པ་ན་སྤྱོད་པ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞིང་མངོན་པར་ཞེན་པ་མེད་པ་ལ་མི་རྟོག་ཅིང་རློམ་སེམས་སུ་མི་བྱེད་དེ།
en: When they engage in conduct, they do not consider it to be real, they do not cling to it, they have no concepts about it, and they do not think about it.

source: དེའི་ཕྱིར་མི་སྤྱོད་པ་ལ་སྤྱོད་པ་ཞེས་བྱའོ། །སྨྲས་པ།
en: That is why this is known as engaging in nonconduct.”

source: འཇམ་དཔལ་ཅིའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་མི་སྤྱོད་པ་ལ་སྤྱོད་པ་ཞེས་བྱ། སྨྲས་པ།
en: “Mañjuśrī, why is it said that bodhisattvas engage in nonconduct?”

source: ཀླུའི་བདག་པོ་གང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ། བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་བར་དུ་དགེ་བའི་སྤྱོད་པ་དང་། མི་སྐྱེ་བའི་སྤྱོད་པ་དང་། དངོས་པོ་མེད་པའི་སྤྱོད་པ་དང་། གཟུང་བ་མེད་པའི་སྤྱོད་པ་དང་། ཀུན་གཞི་མེད་པའི་སྤྱོད་པ་དང་། ཉོན་མོངས་པ་མེད་པའི་སྤྱོད་པ་དང་། ངོ་བོ་ཉིད་མེད་པའི་སྤྱོད་པ་དང་། འབྱུང་བ་མེད་པའི་སྤྱོད་པ་དང་། རྒྱུ་བ་མེད་པའི་སྤྱོད་པ་དང་།
en: “Lord of nāgas, from the first time they develop the intention to reach awakening until they reach the seat of awakening, bodhisattvas who are committed to virtuous conduct, unborn conduct, insubstantial conduct, conduct devoid of apprehension, groundless conduct, conduct devoid of afflictions, conduct devoid of essential nature, conduct beyond origination, conduct beyond movement, baseless conduct, authentic conduct, and ritual conduct are those who engage in the conduct of nonconduct.

source: གནས་པ་མེད་པའི་སྤྱོད་པ་དང་། ཡང་དག་པའི་སྤྱོད་པ་དང་། ཆོ་གའི་སྤྱོད་པ་དང་། སྤྱོད་པ་དེ་ལྟ་བུ་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མི་སྤྱོད་པའི་སྤྱོད་པ་ལ་སྤྱོད་པའོ། །གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་སྤྱད་པ་ལ་སྤྱོད་པར་གྱུར་པ་ན་མཚན་ཉིད་མེད་པའི་རྗེས་སུ་སོང་ཞིང་རྒྱུ་བ་མེད་ལ་ཤེས་རབ་ལ་མོས་པས་རྣམ་པར་གྲོལ་ཏེ།
en: When bodhisattvas engage in unborn conduct, they are liberated, through their commitment to insight, into the absence of characteristics and the concordant absence of movement.

source: རྣམ་པར་གྲོལ་ནས་ཀྱང་གཉིས་སུ་མེད་པའི་མཐའ་ལས་ཀྱང་མི་འདའ་ལ་ཡང་དག་པའི་མཐའ་ཡང་མངོན་སུམ་དུ་འགྱུར་ཞིང་ཡང་དག་པའི་མཐའ་དེ་མངོན་དུ་བྱེད་པ་ཡང་མ་ཡིན་ཏེ།
en: Then, without passing beyond the extent of nonduality, they directly realize the limit of reality without perceiving a limit.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་འཐོབ་བོ། །
en: This is how bodhisattvas reach acceptance of the unborn nature of phenomena.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་ཡང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ཇི་ལྟ་བུ།
en: The nāga king Anavatapta then said to Mañjuśrīkumārabhūta, “Mañjuśrī, what is it like to reach acceptance of the unborn nature of phenomena?”
